---
kind: type
id: T:Autodesk.Revit.DB.DWFImageQuality
source: html/1b2182eb-3d56-7b65-70bc-f904f236266a.htm
---
# Autodesk.Revit.DB.DWFImageQuality

An enumerated type listing possible image quality for DWF Export.

## Syntax (C#)
```csharp
public enum DWFImageQuality
```